Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing Constructor (Identifier, String)
 Instantiates a new single part drawing with given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SinglePartDrawing(
	Identifier partIdentifier,
	string AttributeFile
)
Public Sub New (
	partIdentifier As Identifier,
	AttributeFile As String
)
Parameters
partIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object part
AttributeFile
Type: System.String
The filename of the attributes file.
See Also
Reference
SinglePartDrawing Class
SinglePartDrawing Overload
Tekla.Structures.Drawing Namespace